JMeterHtmlReports/ReportP1L1/statistics.json
{
  "Level 1, Run 1Logout" : {
    "transaction" : "Level 1, Run 1Logout",
    "sampleCount" : 851,
    "errorCount" : 9,
    "errorPct" : 1.0575793,
    "meanResTime" : 1151.7038777908344,
    "medianResTime" : 904.0,
    "minResTime" : 161.0,
    "maxResTime" : 11473.0,
    "pct1ResTime" : 1946.2000000000003,
    "pct2ResTime" : 2511.2,
    "pct3ResTime" : 5570.720000000007,
    "throughput" : 2.9031091582689146,
    "receivedKBytesPerSec" : 28.85847894542257,
    "sentKBytesPerSec" : 1.131841580983441
  },
  "Level 1, Run 1Add Product to Cart" : {
    "transaction" : "Level 1, Run 1Add Product to Cart",
    "sampleCount" : 856,
    "errorCount" : 2,
    "errorPct" : 0.23364486,
    "meanResTime" : 993.5292056074768,
    "medianResTime" : 813.0,
    "minResTime" : 49.0,
    "maxResTime" : 4575.0,
    "pct1ResTime" : 1990.7000000000012,
    "pct2ResTime" : 2353.0,
    "pct3ResTime" : 3092.1499999999996,
    "throughput" : 2.906157591148441,
    "receivedKBytesPerSec" : 27.74031035900043,
    "sentKBytesPerSec" : 0.7440252001378387
  },
  "Level 1, Run 2Add Product to Cart" : {
    "transaction" : "Level 1, Run 2Add Product to Cart",
    "sampleCount" : 878,
    "errorCount" : 15,
    "errorPct" : 1.7084283,
    "meanResTime" : 945.0649202733483,
    "medianResTime" : 742.5,
    "minResTime" : 48.0,
    "maxResTime" : 6523.0,
    "pct1ResTime" : 1789.3000000000002,
    "pct2ResTime" : 2517.5999999999976,
    "pct3ResTime" : 4626.660000000009,
    "throughput" : 2.9442734217286035,
    "receivedKBytesPerSec" : 27.791364888072337,
    "sentKBytesPerSec" : 0.7426081142314372
  },
  "Level 1, Run 2Login" : {
    "transaction" : "Level 1, Run 2Login",
    "sampleCount" : 887,
    "errorCount" : 2,
    "errorPct" : 0.22547914,
    "meanResTime" : 1454.9853438556952,
    "medianResTime" : 1157.0,
    "minResTime" : 70.0,
    "maxResTime" : 8614.0,
    "pct1ResTime" : 2949.2,
    "pct2ResTime" : 3862.3999999999955,
    "pct3ResTime" : 5735.200000000003,
    "throughput" : 2.9407279213330417,
    "receivedKBytesPerSec" : 28.44948542959659,
    "sentKBytesPerSec" : 1.2301781376191046
  },
  "Level 1, Run 1Login-0" : {
    "transaction" : "Level 1, Run 1Login-0",
    "sampleCount" : 859,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 571.7904540162971,
    "medianResTime" : 387.0,
    "minResTime" : 65.0,
    "maxResTime" : 2894.0,
    "pct1ResTime" : 1277.0,
    "pct2ResTime" : 1750.0,
    "pct3ResTime" : 2235.2,
    "throughput" : 2.8722276650026246,
    "receivedKBytesPerSec" : 2.25228708233162,
    "sentKBytesPerSec" : 0.7817175938155153
  },
  "Level 1, Run 1Update Cart" : {
    "transaction" : "Level 1, Run 1Update Cart",
    "sampleCount" : 854,
    "errorCount" : 3,
    "errorPct" : 0.35128805,
    "meanResTime" : 1360.2775175644035,
    "medianResTime" : 1057.5,
    "minResTime" : 157.0,
    "maxResTime" : 6668.0,
    "pct1ResTime" : 2524.5,
    "pct2ResTime" : 3241.0,
    "pct3ResTime" : 4817.35,
    "throughput" : 2.905196696104179,
    "receivedKBytesPerSec" : 29.61266086059648,
    "sentKBytesPerSec" : 1.268850876066486
  },
  "Level 1, Run 2Login-0" : {
    "transaction" : "Level 1, Run 2Login-0",
    "sampleCount" : 887,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 658.4441939120634,
    "medianResTime" : 489.0,
    "minResTime" : 26.0,
    "maxResTime" : 4515.0,
    "pct1ResTime" : 1399.6000000000001,
    "pct2ResTime" : 1699.7999999999975,
    "pct3ResTime" : 2422.04,
    "throughput" : 2.9500487240290947,
    "receivedKBytesPerSec" : 2.3133812782075545,
    "sentKBytesPerSec" : 0.8029155895690667
  },
  "Level 1, Run 1Login-1" : {
    "transaction" : "Level 1, Run 1Login-1",
    "sampleCount" : 859,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 746.2898719441212,
    "medianResTime" : 553.0,
    "minResTime" : 40.0,
    "maxResTime" : 6364.0,
    "pct1ResTime" : 1559.0,
    "pct2ResTime" : 2096.0,
    "pct3ResTime" : 3158.2,
    "throughput" : 2.8647179470077204,
    "receivedKBytesPerSec" : 25.508299063297258,
    "sentKBytesPerSec" : 0.419636418018709
  },
  "Level 1, Run 2Login-1" : {
    "transaction" : "Level 1, Run 2Login-1",
    "sampleCount" : 887,
    "errorCount" : 2,
    "errorPct" : 0.22547914,
    "meanResTime" : 796.5388951521983,
    "medianResTime" : 565.0,
    "minResTime" : 29.0,
    "maxResTime" : 6903.0,
    "pct1ResTime" : 1655.0000000000002,
    "pct2ResTime" : 2333.3999999999987,
    "pct3ResTime" : 4171.040000000002,
    "throughput" : 2.9418885797013004,
    "receivedKBytesPerSec" : 26.153731764519563,
    "sentKBytesPerSec" : 0.4299690284968508
  },
  "Level 1, Run 1Update Cart-0" : {
    "transaction" : "Level 1, Run 1Update Cart-0",
    "sampleCount" : 854,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 581.192037470726,
    "medianResTime" : 361.0,
    "minResTime" : 22.0,
    "maxResTime" : 3629.0,
    "pct1ResTime" : 1415.5,
    "pct2ResTime" : 1824.0,
    "pct3ResTime" : 2822.600000000012,
    "throughput" : 2.905710708258479,
    "receivedKBytesPerSec" : 1.898359827954026,
    "sentKBytesPerSec" : 0.8336188219622734
  },
  "Level 1, Run 2Logout" : {
    "transaction" : "Level 1, Run 2Logout",
    "sampleCount" : 858,
    "errorCount" : 1,
    "errorPct" : 0.11655012,
    "meanResTime" : 1151.363636363635,
    "medianResTime" : 876.0,
    "minResTime" : 91.0,
    "maxResTime" : 7597.0,
    "pct1ResTime" : 2257.3,
    "pct2ResTime" : 2946.1499999999996,
    "pct3ResTime" : 5384.399999999986,
    "throughput" : 2.9089084473616404,
    "receivedKBytesPerSec" : 29.09769605996318,
    "sentKBytesPerSec" : 1.1414771927846865
  },
  "Level 1, Run 2Update Cart-1" : {
    "transaction" : "Level 1, Run 2Update Cart-1",
    "sampleCount" : 858,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 755.3135198135203,
    "medianResTime" : 555.5,
    "minResTime" : 31.0,
    "maxResTime" : 8592.0,
    "pct1ResTime" : 1468.1,
    "pct2ResTime" : 1945.2999999999997,
    "pct3ResTime" : 3991.599999999998,
    "throughput" : 2.9815063209323984,
    "receivedKBytesPerSec" : 28.51065419391606,
    "sentKBytesPerSec" : 0.448390599046474
  },
  "Level 1, Run 2Home" : {
    "transaction" : "Level 1, Run 2Home",
    "sampleCount" : 887,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 599.4250281848928,
    "medianResTime" : 463.0,
    "minResTime" : 33.0,
    "maxResTime" : 4599.0,
    "pct1ResTime" : 1247.2,
    "pct2ResTime" : 1525.7999999999947,
    "pct3ResTime" : 2608.28,
    "throughput" : 2.9897331149176556,
    "receivedKBytesPerSec" : 26.621471232245298,
    "sentKBytesPerSec" : 0.437949186755516
  },
  "Level 1, Run 2Update Cart-0" : {
    "transaction" : "Level 1, Run 2Update Cart-0",
    "sampleCount" : 858,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 671.3986013986007,
    "medianResTime" : 543.5,
    "minResTime" : 14.0,
    "maxResTime" : 3049.0,
    "pct1ResTime" : 1400.5,
    "pct2ResTime" : 1765.049999999999,
    "pct3ResTime" : 2513.9399999999987,
    "throughput" : 2.9852200295042723,
    "receivedKBytesPerSec" : 1.9503048825569906,
    "sentKBytesPerSec" : 0.8563983150729256
  },
  "Level 1, Run 2Look at Product" : {
    "transaction" : "Level 1, Run 2Look at Product",
    "sampleCount" : 884,
    "errorCount" : 6,
    "errorPct" : 0.67873305,
    "meanResTime" : 2243.419683257921,
    "medianResTime" : 1657.0,
    "minResTime" : 116.0,
    "maxResTime" : 11124.0,
    "pct1ResTime" : 4367.0,
    "pct2ResTime" : 5614.25,
    "pct3ResTime" : 8720.25,
    "throughput" : 2.9412645441206315,
    "receivedKBytesPerSec" : 344.28279747031286,
    "sentKBytesPerSec" : 0.4672018018572555
  },
  "Level 1, Run 1Look at Product" : {
    "transaction" : "Level 1, Run 1Look at Product",
    "sampleCount" : 857,
    "errorCount" : 1,
    "errorPct" : 0.11668611,
    "meanResTime" : 2675.38039673279,
    "medianResTime" : 2355.0,
    "minResTime" : 153.0,
    "maxResTime" : 12407.0,
    "pct1ResTime" : 4776.8,
    "pct2ResTime" : 5831.599999999993,
    "pct3ResTime" : 8034.039999999994,
    "throughput" : 2.865492383206944,
    "receivedKBytesPerSec" : 338.44345075018555,
    "sentKBytesPerSec" : 0.4577640800331688
  },
  "Level 1, Run 2List Products" : {
    "transaction" : "Level 1, Run 2List Products",
    "sampleCount" : 885,
    "errorCount" : 1,
    "errorPct" : 0.11299435,
    "meanResTime" : 2016.9435028248627,
    "medianResTime" : 1512.0,
    "minResTime" : 130.0,
    "maxResTime" : 14942.0,
    "pct1ResTime" : 4129.8,
    "pct2ResTime" : 5341.899999999987,
    "pct3ResTime" : 8550.4,
    "throughput" : 2.937369311958578,
    "receivedKBytesPerSec" : 336.8140984651415,
    "sentKBytesPerSec" : 0.5042898868200073
  },
  "Level 1, Run 2Update Cart" : {
    "transaction" : "Level 1, Run 2Update Cart",
    "sampleCount" : 863,
    "errorCount" : 5,
    "errorPct" : 0.57937425,
    "meanResTime" : 1427.1193511008098,
    "medianResTime" : 1189.0,
    "minResTime" : 43.0,
    "maxResTime" : 8728.0,
    "pct1ResTime" : 2592.4,
    "pct2ResTime" : 3256.2,
    "pct3ResTime" : 5850.600000000001,
    "throughput" : 2.9046285575809794,
    "receivedKBytesPerSec" : 29.544309048439644,
    "sentKBytesPerSec" : 1.2627485068761948
  },
  "Level 1, Run 1List Products" : {
    "transaction" : "Level 1, Run 1List Products",
    "sampleCount" : 859,
    "errorCount" : 2,
    "errorPct" : 0.23282887,
    "meanResTime" : 2085.68102444703,
    "medianResTime" : 1745.0,
    "minResTime" : 50.0,
    "maxResTime" : 10171.0,
    "pct1ResTime" : 3811.0,
    "pct2ResTime" : 4608.0,
    "pct3ResTime" : 7102.999999999995,
    "throughput" : 2.866123026412375,
    "receivedKBytesPerSec" : 329.87307841611664,
    "sentKBytesPerSec" : 0.4914679454669211
  },
  "Level 1, Run 1Update Cart-1" : {
    "transaction" : "Level 1, Run 1Update Cart-1",
    "sampleCount" : 854,
    "errorCount" : 3,
    "errorPct" : 0.35128805,
    "meanResTime" : 779.0433255269318,
    "medianResTime" : 641.0,
    "minResTime" : 50.0,
    "maxResTime" : 5688.0,
    "pct1ResTime" : 1398.0,
    "pct2ResTime" : 1773.25,
    "pct3ResTime" : 2706.150000000015,
    "throughput" : 2.9063435883474,
    "receivedKBytesPerSec" : 27.7255778282824,
    "sentKBytesPerSec" : 0.43555139489177785
  },
  "Level 1, Run 1Home" : {
    "transaction" : "Level 1, Run 1Home",
    "sampleCount" : 872,
    "errorCount" : 4,
    "errorPct" : 0.4587156,
    "meanResTime" : 600.4506880733936,
    "medianResTime" : 493.0,
    "minResTime" : 48.0,
    "maxResTime" : 3496.0,
    "pct1ResTime" : 1031.7,
    "pct2ResTime" : 1358.199999999997,
    "pct3ResTime" : 2343.43,
    "throughput" : 2.905465740827125,
    "receivedKBytesPerSec" : 25.786854454325542,
    "sentKBytesPerSec" : 0.4236530150870973
  },
  "Level 1, Run 1Logout-1" : {
    "transaction" : "Level 1, Run 1Logout-1",
    "sampleCount" : 847,
    "errorCount" : 5,
    "errorPct" : 0.5903188,
    "meanResTime" : 659.8913813459264,
    "medianResTime" : 503.0,
    "minResTime" : 47.0,
    "maxResTime" : 11151.0,
    "pct1ResTime" : 1094.2000000000016,
    "pct2ResTime" : 1561.799999999998,
    "pct3ResTime" : 3698.8399999999992,
    "throughput" : 2.892917645772993,
    "receivedKBytesPerSec" : 25.659684672617015,
    "sentKBytesPerSec" : 0.4212656557393847
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 22485,
    "errorCount" : 71,
    "errorPct" : 0.31576607,
    "meanResTime" : 1074.1443184345203,
    "medianResTime" : 723.0,
    "minResTime" : 14.0,
    "maxResTime" : 14942.0,
    "pct1ResTime" : 2357.0,
    "pct2ResTime" : 3169.9500000000007,
    "pct3ResTime" : 5538.990000000002,
    "throughput" : 74.51261097358505,
    "receivedKBytesPerSec" : 1789.4673695097279,
    "sentKBytesPerSec" : 18.454494383593307
  },
  "Level 1, Run 1Logout-0" : {
    "transaction" : "Level 1, Run 1Logout-0",
    "sampleCount" : 847,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 495.32939787485276,
    "medianResTime" : 365.0,
    "minResTime" : 34.0,
    "maxResTime" : 3166.0,
    "pct1ResTime" : 1035.000000000001,
    "pct2ResTime" : 1288.1999999999998,
    "pct3ResTime" : 2077.919999999998,
    "throughput" : 2.895716595840698,
    "receivedKBytesPerSec" : 3.201124205558272,
    "sentKBytesPerSec" : 0.7126177560076719
  },
  "Level 1, Run 1Login" : {
    "transaction" : "Level 1, Run 1Login",
    "sampleCount" : 868,
    "errorCount" : 9,
    "errorPct" : 1.0368663,
    "meanResTime" : 1310.3110599078327,
    "medianResTime" : 1004.0,
    "minResTime" : 133.0,
    "maxResTime" : 8003.0,
    "pct1ResTime" : 2649.1,
    "pct2ResTime" : 3497.6499999999987,
    "pct3ResTime" : 4797.62,
    "throughput" : 2.892870474057484,
    "receivedKBytesPerSec" : 27.814263910482655,
    "sentKBytesPerSec" : 1.1985387025575909
  },
  "Level 1, Run 2Logout-0" : {
    "transaction" : "Level 1, Run 2Logout-0",
    "sampleCount" : 858,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 544.1410256410257,
    "medianResTime" : 385.0,
    "minResTime" : 21.0,
    "maxResTime" : 4890.0,
    "pct1ResTime" : 1179.0,
    "pct2ResTime" : 1489.0,
    "pct3ResTime" : 2606.0699999999993,
    "throughput" : 2.935852646202382,
    "receivedKBytesPerSec" : 3.2454933549815395,
    "sentKBytesPerSec" : 0.7224949871513674
  },
  "Level 1, Run 2Logout-1" : {
    "transaction" : "Level 1, Run 2Logout-1",
    "sampleCount" : 858,
    "errorCount" : 1,
    "errorPct" : 0.11655012,
    "meanResTime" : 607.1864801864813,
    "medianResTime" : 415.0,
    "minResTime" : 28.0,
    "maxResTime" : 5584.0,
    "pct1ResTime" : 1238.1,
    "pct2ResTime" : 1603.4499999999987,
    "pct3ResTime" : 3552.9199999999996,
    "throughput" : 2.9167006608468626,
    "receivedKBytesPerSec" : 25.951319829357715,
    "sentKBytesPerSec" : 0.4267531117422697
  }
}